#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dynamic_subnets.data.aws_availability_zones.default[0]: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.default: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.complete: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Reading...
module.vpc.aws_vpc.default[0]: Refreshing state... [id=vpc-009113f13a599a330]
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Read complete after 1s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Read complete after 1s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.default: Read complete after 1s [id=aws]
module.dynamic_subnets.data.aws_availability_zones.default[0]: Read complete after 1s [id=eu-west-2]
module.dynamic_subnets.module.utils.data.aws_regions.complete: Read complete after 1s [id=aws]
module.vpc.aws_default_security_group.default[0]: Refreshing state... [id=sg-01914e6fda4b47ab4]
module.vpc.aws_internet_gateway.default[0]: Refreshing state... [id=igw-0c255c6f8c041d2e3]
module.wireguard_vpn_sg.aws_security_group.cbd[0]: Refreshing state... [id=sg-0015a96a6a9aad23e]
module.dynamic_subnets.aws_route_table.private[2]: Refreshing state... [id=rtb-09b4ce21efd237180]
module.dynamic_subnets.aws_route_table.private[0]: Refreshing state... [id=rtb-0b765231b1cd54b54]
module.dynamic_subnets.data.aws_vpc.default[0]: Reading...
module.dynamic_subnets.aws_route_table.public[0]: Refreshing state... [id=rtb-036d1eb5858c48377]
module.smb_fileserver_sg.aws_security_group.cbd[0]: Refreshing state... [id=sg-00f5875d89f648e6e]
module.dynamic_subnets.aws_route_table.private[1]: Refreshing state... [id=rtb-0e89938b479a4f22f]
module.wireguard_vpn_sg.aws_security_group_rule.dbc["allow_all"]: Refreshing state... [id=sgrule-1353645445]
module.wireguard_vpn_sg.aws_security_group_rule.dbc["wireguard_envoy"]: Refreshing state... [id=sgrule-242630741]
module.wireguard_vpn_sg.aws_security_group_rule.dbc["_allow_all_egress_"]: Refreshing state... [id=sgrule-2607952764]
module.wireguard_vpn_sg.aws_security_group_rule.dbc["smb_envoy"]: Refreshing state... [id=sgrule-1778838056]
module.wireguard_vpn_sg.aws_security_group_rule.dbc["ssh_gr_home"]: Refreshing state... [id=sgrule-1377530524]
module.smb_fileserver_sg.aws_security_group_rule.dbc["allow_all"]: Refreshing state... [id=sgrule-144333041]
module.smb_fileserver_sg.aws_security_group_rule.dbc["smb_vpc"]: Refreshing state... [id=sgrule-2445211759]
module.smb_fileserver_sg.aws_security_group_rule.dbc["_allow_all_egress_"]: Refreshing state... [id=sgrule-4223506708]
module.dynamic_subnets.aws_route.public[0]: Refreshing state... [id=r-rtb-036d1eb5858c483771080289494]
module.dynamic_subnets.data.aws_vpc.default[0]: Read complete after 0s [id=vpc-009113f13a599a330]
module.dynamic_subnets.aws_subnet.private[2]: Refreshing state... [id=subnet-0757ea0b9aa8b1905]
module.dynamic_subnets.aws_subnet.private[0]: Refreshing state... [id=subnet-03363401b701c0192]
module.dynamic_subnets.aws_subnet.public[0]: Refreshing state... [id=subnet-07d0f68ddec76c093]
module.dynamic_subnets.aws_subnet.public[2]: Refreshing state... [id=subnet-080e4686fb6af02db]
module.dynamic_subnets.aws_subnet.private[1]: Refreshing state... [id=subnet-0ea23e3cd8591b717]
module.dynamic_subnets.aws_subnet.public[1]: Refreshing state... [id=subnet-02b9ad0df5d6be999]
module.dynamic_subnets.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a60ca583e16878f2]
module.dynamic_subnets.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-046fbaf13e9009eb8]
module.dynamic_subnets.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0330b9b10cd5d8273]
module.dynamic_subnets.aws_network_acl.private[0]: Refreshing state... [id=acl-0e201fd43623ce6b3]
module.dynamic_subnets.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0867802849ff830ff]
module.dynamic_subnets.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01e7dc066ea565010]
module.dynamic_subnets.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0af19d8609c79a2c8]
module.dynamic_subnets.aws_network_acl.public[0]: Refreshing state... [id=acl-081a94a3fbc7d4d73]
module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0]: Refreshing state... [id=nacl-3318788472]
module.dynamic_subnets.aws_network_acl_rule.private4_egress[0]: Refreshing state... [id=nacl-1793541639]
module.dynamic_subnets.aws_network_acl_rule.public4_egress[0]: Refreshing state... [id=nacl-717500771]
module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0]: Refreshing state... [id=nacl-2404333390]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.smb_fileserver_sg.aws_security_group.cbd[0] has changed
  ~ resource "aws_security_group" "cbd" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all egress"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-00f5875d89f648e6e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/24",
                ]
              + description      = "SMB from VPC network"
              + from_port        = 445
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 445
            },
          + {
              + cidr_blocks      = []
              + description      = "Inbound from all resources in this SG"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "-20241226155944399100000001"
      + tags                   = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group.cbd[0] has changed
  ~ resource "aws_security_group" "cbd" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all egress"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0015a96a6a9aad23e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "154.59.148.74/32",
                ]
              + description      = "SSH from GR home"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "157.231.92.5/32",
                ]
              + description      = "Wireguard from Envoy Office"
              + from_port        = 51820
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 51820
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.0/24",
                ]
              + description      = "SMB from Envoy Office"
              + from_port        = 445
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 445
            },
          + {
              + cidr_blocks      = []
              + description      = "Inbound from all resources in this SG"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "-20241226155944399200000002"
      + tags                   = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.smb_fileserver_sg.aws_security_group.cbd[0] must be replaced
+/- resource "aws_security_group" "cbd" {
      ~ arn                    = "arn:aws:ec2:eu-west-2:517553980935:security-group/sg-00f5875d89f648e6e" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-00f5875d89f648e6e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.1.0.0/24",
                ]
              - description      = "SMB from VPC network"
              - from_port        = 445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 445
            },
          - {
              - cidr_blocks      = []
              - description      = "Inbound from all resources in this SG"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "-20241226155944399100000001" -> (known after apply)
      ~ name_prefix            = "-" -> "envoy-prod-smb-sg-" # forces replacement
      ~ owner_id               = "517553980935" -> (known after apply)
      ~ tags                   = {
          + "Attributes" = "envoy-prod-smb-sg"
          + "Name"       = "envoy-prod-smb-sg"
        }
      ~ tags_all               = {
          + "Attributes" = "envoy-prod-smb-sg"
          + "Name"       = "envoy-prod-smb-sg"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["_allow_all_egress_"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-4223506708" -> (known after apply)
      ~ security_group_id        = "sg-00f5875d89f648e6e" # forces replacement -> (known after apply) # forces replacement
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["allow_all"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-144333041" -> (known after apply)
      ~ security_group_id        = "sg-00f5875d89f648e6e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-052083fb7379086b3" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["smb_vpc"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-2445211759" -> (known after apply)
      ~ security_group_id        = "sg-00f5875d89f648e6e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0ed67972548e0383d" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group.cbd[0] must be replaced
+/- resource "aws_security_group" "cbd" {
      ~ arn                    = "arn:aws:ec2:eu-west-2:517553980935:security-group/sg-0015a96a6a9aad23e" -> (known after apply)
      ~ description            = "SMB File Server Security Group" -> "Wireguard Security Group" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0015a96a6a9aad23e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "154.59.148.74/32",
                ]
              - description      = "SSH from GR home"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "157.231.92.5/32",
                ]
              - description      = "Wireguard from Envoy Office"
              - from_port        = 51820
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 51820
            },
          - {
              - cidr_blocks      = [
                  - "192.168.1.0/24",
                ]
              - description      = "SMB from Envoy Office"
              - from_port        = 445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 445
            },
          - {
              - cidr_blocks      = []
              - description      = "Inbound from all resources in this SG"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "-20241226155944399200000002" -> (known after apply)
      ~ name_prefix            = "-" -> "envoy-prod-wireguard-sg-" # forces replacement
      ~ owner_id               = "517553980935" -> (known after apply)
      ~ tags                   = {
          + "Attributes" = "envoy-prod-wireguard-sg"
          + "Name"       = "envoy-prod-wireguard-sg"
        }
      ~ tags_all               = {
          + "Attributes" = "envoy-prod-wireguard-sg"
          + "Name"       = "envoy-prod-wireguard-sg"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["_allow_all_egress_"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-2607952764" -> (known after apply)
      ~ security_group_id        = "sg-0015a96a6a9aad23e" # forces replacement -> (known after apply) # forces replacement
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["allow_all"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-1353645445" -> (known after apply)
      ~ security_group_id        = "sg-0015a96a6a9aad23e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0dddf13433450cb46" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["smb_envoy"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-1778838056" -> (known after apply)
      ~ security_group_id        = "sg-0015a96a6a9aad23e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0f28f4dd155258246" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["ssh_gr_home"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-1377530524" -> (known after apply)
      ~ security_group_id        = "sg-0015a96a6a9aad23e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0143eb461770217ba" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["wireguard_envoy"] must be replaced
-/+ resource "aws_security_group_rule" "dbc" {
      ~ id                       = "sgrule-242630741" -> (known after apply)
      ~ security_group_id        = "sg-0015a96a6a9aad23e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-046c4c1dc736b1dbd" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gerrardrose, Action: `pull_request`*